# 1 -------------------------------------------------------------------
from bs4 import BeautifulSoup
import requests
import csv
# 1 -------------------------------------------------------------------

# 2 -------------------------------------------------------------------
with open('rezult.csv', 'w', encoding='utf-8-sig',newline='') as file:
    writer = csv.writer(file, delimiter=';')
    writer.writerow([
        'Наименование', 'Артикул', 'Бренд', 'Модель', 'Тип', 
        'Технология экрана', 'Материал корпуса', 'Материал браслета', 
        'Размер', 'Сайт производителя', 'Наличие', 'Цена', 'Старая цена',
        'Ссылка на карточку с товаром'
    ])